#ifndef __BSP_SRAM_H__
#define __BSP_SRAM_H__															    

/* 包含头文件 ----------------------------------------------------------------*/
#include "headfile.h"

/* 类型定义 ------------------------------------------------------------------*/
/* 宏定义 --------------------------------------------------------------------*/
//使用NOR/SRAM的 Bank1.sector3
//对IS61LV51216/IS62WV51216,地址线范围为A0~A18
#define EXSRAM_BANK_ADDR    ((uint32_t)(0x68000000))

/* 扩展变量 ------------------------------------------------------------------*/
extern SRAM_HandleTypeDef hexSRAM;

/* 函数声明 ------------------------------------------------------------------*/		  
void MX_FSMC_exSRAM_Init(void);

#endif  /* __BSP_SRAM_H__ */

/******************* (C) COPYRIGHT 2015-2020 硬石嵌入式开发团队 *****END OF FILE****/
